from fpdf import FPDF

pdf = FPDF(orientation='P', unit='mm', format='A4')
pdf.add_font("dejavu-sans", style="", fname="font/DejaVuSans.ttf", uni=True)

pdf.add_page()

pdf.set_font(family="dejavu-sans", style="", size=18)
pdf.set_text_color(255, 255, 255)
pdf.set_fill_color(39, 111, 179)
pdf.cell(0, 10, "Online Banking", ln=True, align="C", fill=True)
pdf.ln(8)

pdf.image("logo.png", x=60, y=None, w=90) 
pdf.ln(1)

pdf.set_text_color(0, 0, 0)
pdf.set_font("dejavu-sans", "", 14)
pdf.cell(0, 10, "Рисунок 1 – Logo", ln=True, align="C")
pdf.ln(20)

pdf.set_font(family="dejavu-sans", style="", size=14)
pdf.set_text_color(0, 0, 0)

paragraph = (
    "   Ідея проєкту полягає в розробці ефективного і безпечного вебзастосування "
    "для дистанційного банківського обслуговування, яке дозволить проводити "
    "фінансові операції онлайн. Основні варіанти використання вебзастосування — "
    "це перегляд інформації про рахунок клієнта, історія транзакцій, управління "
    "персональними даними, переказ коштів, оплата послуг. "
    "Забезпечується шифрування даних для їх безпеки. "
    "Онлайн-чат забезпечує відповідь на запити клієнта."
)
pdf.multi_cell(0, 8, paragraph, align='J')

pdf.set_y(-10)
pdf.set_font("dejavu-sans", "", 10)
pdf.cell(0, 10, f"{pdf.page_no()}", align="R")

pdf.ln(15)
pdf.set_font(family="dejavu-sans", style="", size=14)

paragraph1 = (
    "   Метою роботи є створення програмного застосування для забезпечення віддаленого обслуговування клієнтів банку. "
    "Клієнти зможуть виконувати необхідні дії через вебінтерфейс, а банк зможе зменшити витрати на фізичні відділення."
    "Клієнти зможуть виконувати операції оплати послуг у будь-який час, бо в іншому випадку потребували б оплати у відділенні. "
    "Банк буде посередником між постачальниками та клієнтами, а вебінтерфейс реалізує це. "
    "Забезпечено соціальну систему, завдяки якій клієнти зможуть здійснювати перекази один між одним і написати невелике пояснення переказу, а отримувач побачить результат і повідомлення на балансі."
)

pdf.multi_cell(0, 8, paragraph1, align='J')

pdf.output("my_pdf.pdf")